import sys as ş̛̣̘͍͚͖̰̩̓ͫ̄̇̔̐̋ͥ̈ͪ̑̎̈̑̀͘͜i̤̮̖̦͔͍̦͓͉͕ͥ͂ͪ͒̀͡͡sͩ͛ͧͥ̊ͮ̍̃̇̇͏̷̗̩̺͍͎͉͇̟
import numpy as ṉ̟̯͖̜͚͙̈́̄̒͆̏̆͗̐͑ͯ͂̋̋ͧͬ̊̿́̓́͟͞p̡͂ͯͪ̏ͧ̽̿̎͋ͨ̅̆̄̂͂̀͏̰͎͖̳̳̼͉͉͘

aͨ̃̾̉ͥ͌̓ͤ̓̓̈̈͆ͯ̑́͏̸̪͉̱̯̮̝̲̦̗̻̘̳̣͍̱̮͈ͅͅb̨̛̤̭̝͇̘̳̻̻̖̞̤̠̮̭ͫ̀ͭ͗͒̄ͧ̽̉͌̆ͭ͠š̷̶̹͔̮ͪ̊͆̒͂̔̔ͧ̾̽̉̆̇̾̿ͪ͠ = abs
r̸̶̯̟̭̣͔̙̥̜͙̰̱̜̻̘̈́̉̒̒̑̏͛̅̏ͧ̃ͪ͟͞͠a̶̧̞̮͇̠͙̼̖̦͎̻̠̹ͤ̄͊ͮ́̀̚ǹ̃ͤͨͪͮ̅͌̓̈ͨͬͭ̑̒̓̈͑͝͏̥̩̙̝̞͍̰̻̹̹̪̠͉̺̞͜͢g̰͖̘͓͇̫̮̰̼̯͓̳̞̟̹̉̅ͯ̇̏ͫ͛ͩ̒ͤ͌̐ͮͥ̑ͬͣ̏̃͞͝e̸̡̗͔̦̗̰̪̼̔̽̂ͣ̈̈ͬ̈͘ = range
l̢̤̭͈̞̖͍͍̲̥̗̪̻̼͔̠̱͕͌͆ͨ͂̋͗̎̉ͨ̌̍̚͜͜͝e̡̡̙̥͖͇̬̥̬̲̗͕ͮͨͬ͌ͦ̍̑ͪ̏̃̅̏̊̓͂̋̾͜n̹̱͔͖̥͕̩̤͍̝̹̤̬̉ͧ͒ͦ̌̋ͬ̈̒ͧͥ̄ͪͤͩ̌͝ = len
z̛̰̞̱̹͎͇̜͕͓̳͙̠͖͍͍̙͒̈́̽̐ͮͨ̒̄ͩ̃ͨͮͨ̎̀͟ͅi̵̯̞͚̖͓̯̻̗̯̦̱͈̼͕̮̻̩̋́̀ͩ̆ͅp̴̸̷̦̣͔͔̪̖̱̜͙̈̔ͨͦ͊͋ͦͪͧ̂ = zip
ş̛̣̘͍͚͖̰̩̓ͫ̄̇̔̐̋ͥ̈ͪ̑̎̈̑̀͘͜i̤̮̖̦͔͍̦͓͉͕ͥ͂ͪ͒̀͡͡sͩ͛ͧͥ̊ͮ̍̃̇̇͏̷̗̩̺͍͎͉͇̟.ḁ̵̶̛͕͔͓̈́̉̀̅ͬͮ͛̑ͥ̍̍ͨͦͅŗ̵̪̼͔̬̙̖͎͎͈̼̪̰̺͍̈͋͌͑ͨ̀g̸̷̲̤͓̘̱͇̙̼̻̥̪̭͍̲̪̫͇̉̏̐͆̑̂͒̂͋ͮͯͨͧͤ̇̈́͂́̚̕v̴̛̛͉͍͖̹̮̝̼̯͇͇̯̎ͦ̈̆̈̅͛ͬ̑̓̈͐̒̀̇͋̽̚̚ͅ = ş̛̣̘͍͚͖̰̩̓ͫ̄̇̔̐̋ͥ̈ͪ̑̎̈̑̀͘͜i̤̮̖̦͔͍̦͓͉͕ͥ͂ͪ͒̀͡͡sͩ͛ͧͥ̊ͮ̍̃̇̇͏̷̗̩̺͍͎͉͇̟.argv
list.p̷̭͍̘̮̦̣͔̖̝͚̼̤̩ͥ̋͗͂͋̓̽ͯ̐̈́͐̈́̑̔͆ͦ͛ͦ̀̚̕͟o̶̢̨̢̹͈̙͕͕̹̪͍͖̞̗̾̿̔͛̕ṗ̴̬̠̺͖͚̯̻̦̞̜̥ͫ͋̀ͤ̓ͬ͂̔̚ = list.pop
